#### Terraform Format and Style 🖌success
#### Terraform Initialization ⚙️success
#### Terraform Validation 🤖success
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.

```
</details>

#### Terraform Plan 📖success
<details><summary>Show Plan</summary>

```
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.common: Reading...
data.google_service_account_access_token.default: Reading...
data.google_service_account_access_token.default: Read complete after 0s [id=projects/-/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com]
module.enable_google_apis.google_project_service.project_services["bigquery.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/bigquery.googleapis.com]
module.enable_google_apis.google_project_service.project_services["sts.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/sts.googleapis.com]
module.enable_google_apis.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/secretmanager.googleapis.com]
module.enable_google_apis.google_project_service.project_services["storage.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/storage.googleapis.com]
module.bq.google_bigquery_dataset_iam_member.bigquery_editor_role["videos"]: Refreshing state... [id=projects/youtube-data-api-385206/datasets/stg_videos/roles/bigquery.dataEditor/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
module.enable_google_apis.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/cloudresourcemanager.googleapis.com]
module.enable_google_apis.google_project_service.project_services["youtube.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/youtube.googleapis.com]
module.enable_google_apis.google_project_service.project_services["cloudscheduler.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/cloudscheduler.googleapis.com]
module.bq.google_bigquery_dataset.dataset["videos"]: Refreshing state... [id=projects/youtube-data-api-385206/datasets/stg_videos]
module.enable_google_apis.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/iam.googleapis.com]
module.enable_google_apis.google_project_service.project_services["artifactregistry.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/artifactregistry.googleapis.com]
data.terraform_remote_state.common: Read complete after 2s
module.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/pubsub.googleapis.com]
module.enable_google_apis.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/iamcredentials.googleapis.com]
module.enable_google_apis.google_project_service.project_services["run.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/run.googleapis.com]
module.pubsub_topic.google_pubsub_topic.main: Refreshing state... [id=projects/youtube-data-api-385206/topics/stg-youtube-data-api]
module.storage.google_storage_bucket.bucket: Refreshing state... [id=stg-youtube-data-api-385206-bucket]
module.pubsub_topic.google_pubsub_topic_iam_member.topic_publisher_role: Refreshing state... [id=projects/youtube-data-api-385206/topics/stg-youtube-data-api/roles/pubsub.publisher/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
module.pubsub_topic.google_pubsub_topic.main_dead_letter: Refreshing state... [id=projects/youtube-data-api-385206/topics/stg-stg-youtube-data-api-dlq]
module.storage.google_storage_bucket_iam_member.member: Refreshing state... [id=b/stg-youtube-data-api-385206-bucket/roles/storage.admin/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
module.run.google_cloud_run_v2_service.api: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/services/stg-youtube-data-api-api]
module.run.google_cloud_run_service_iam_member.api_invoker: Refreshing state... [id=v1/projects/youtube-data-api-385206/locations/asia-northeast1/services/stg-youtube-data-api-api/roles/run.invoker/serviceAccount:cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com]
module.scheduler.google_cloud_scheduler_job.invoke-transfer: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/jobs/stg-invoke-transfer]
module.pubsub_subscription.google_pubsub_subscription.main: Refreshing state... [id=projects/youtube-data-api-385206/subscriptions/stg-youtube-data-api-sub]
module.pubsub_subscription.google_pubsub_subscription_iam_member.subscription_subscriber_role: Refreshing state... [id=projects/youtube-data-api-385206/subscriptions/stg-youtube-data-api-sub/roles/pubsub.subscriber/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bq_datasets.google_bigquery_dataset.dataset["videos"] will be created
  + resource "google_bigquery_dataset" "dataset" {
      + creation_time              = (known after apply)
      + dataset_id                 = "stg_videos"
      + default_collation          = (known after apply)
      + delete_contents_on_destroy = false
      + description                = "YouTube Data API Dataset"
      + effective_labels           = (known after apply)
      + etag                       = (known after apply)
      + id                         = (known after apply)
      + is_case_insensitive        = (known after apply)
      + last_modified_time         = (known after apply)
      + location                   = "US"
      + max_time_travel_hours      = (known after apply)
      + project                    = "youtube-data-api-385206"
      + self_link                  = (known after apply)
      + storage_billing_model      = (known after apply)
      + terraform_labels           = (known after apply)

      + access (known after apply)
    }

  # module.bq_datasets.google_bigquery_dataset_iam_member.bigquery_editor_role["videos"] will be created
  + resource "google_bigquery_dataset_iam_member" "bigquery_editor_role" {
      + dataset_id = "stg_videos"
      + etag       = (known after apply)
      + id         = (known after apply)
      + member     = "serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com"
      + project    = (known after apply)
      + role       = "roles/bigquery.dataEditor"
    }

  # module.bq_tables.google_bigquery_table.tables["videos/most_popular.yaml"] will be created
  + resource "google_bigquery_table" "tables" {
      + clustering          = [
          + "CHANNEL_ID",
          + "VIDEO_ID",
        ]
      + creation_time       = (known after apply)
      + dataset_id          = "stg_videos"
      + deletion_protection = false
      + effective_labels    = (known after apply)
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "youtube-data-api-385206"
      + schema              = jsonencode(
            [
              + {
                  + description = "動画ID"
                  + fields      = []
                  + mode        = "REQUIRED"
                  + name        = "VIDEO_ID"
                  + type        = "STRING"
                },
              + {
                  + description = "動画のタイトル"
                  + fields      = []
                  + mode        = "REQUIRED"
                  + name        = "TITLE"
                  + type        = "STRING"
                },
              + {
                  + description = "チャンネルID"
                  + fields      = []
                  + mode        = "REQUIRED"
                  + name        = "CHANNEL_ID"
                  + type        = "STRING"
                },
              + {
                  + description = "チャンネルのタイトル"
                  + fields      = []
                  + mode        = "REQUIRED"
                  + name        = "CHANNEL_TITLE"
                  + type        = "STRING"
                },
              + {
                  + description = "投稿日"
                  + fields      = []
                  + mode        = "REQUIRED"
                  + name        = "PUBLISHED_AT"
                  + type        = "DATETIME"
                },
              + {
                  + description = "データ取得日"
                  + fields      = []
                  + mode        = "REQUIRED"
                  + name        = "CREATED_AT"
                  + type        = "DATETIME"
                },
              + {
                  + description = "カテゴリID"
                  + fields      = []
                  + mode        = "REQUIRED"
                  + name        = "CATEGORY_ID"
                  + type        = "INTEGER"
                },
              + {
                  + description = "動画の長さ"
                  + fields      = []
                  + mode        = "REQUIRED"
                  + name        = "DURATION"
                  + type        = "STRING"
                },
              + {
                  + description = "視聴回数"
                  + fields      = []
                  + mode        = "NULLABLE"
                  + name        = "VIEW_COUNT"
                  + type        = "INTEGER"
                },
              + {
                  + description = "高評価数"
                  + fields      = []
                  + mode        = "NULLABLE"
                  + name        = "LIKE_COUNT"
                  + type        = "INTEGER"
                },
              + {
                  + description = "低評価数"
                  + fields      = []
                  + mode        = "NULLABLE"
                  + name        = "DISLIKE_COUNT"
                  + type        = "INTEGER"
                },
              + {
                  + description = "お気に入り数"
                  + fields      = []
                  + mode        = "NULLABLE"
                  + name        = "FAVORITE_COUNT"
                  + type        = "INTEGER"
                },
              + {
                  + description = "コメント数"
                  + fields      = []
                  + mode        = "NULLABLE"
                  + name        = "COMMENT_COUNT"
                  + type        = "INTEGER"
                },
              + {
                  + description = "タグ情報"
                  + fields      = []
                  + mode        = "REPEATED"
                  + name        = "TAGS"
                  + type        = "STRING"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "stg_most_popular"
      + terraform_labels    = (known after apply)
      + type                = (known after apply)

      + time_partitioning {
          + expiration_ms = (known after apply)
          + field         = "CREATED_AT"
          + type          = "DAY"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>

**Pusher: @Kamegrueon, Action: pull_request, Working Directory: ./terraform/common_stack, Workflow: deploy**
